DataProcessors/ОбработкаСМСФИНАНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаСМСФИНАНС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПередачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗвонокВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗвонокУспешные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СМС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автоинформатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Письмо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендацииАгентства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРасчетногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСсудногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФинансирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕжемесячногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозникновенияДолга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкПервоначальныйКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаСМСФИНАНС/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	
	 ДвумМассив = Новый Массив;

	
      ДвумМассив= СформироватьНаСервере(Объект.Банк);
	 
	  
	  // Это должники с номером договора - ДвумМассив
	 
	  
	  

	  
	  //ТабЗначений.Колонки.Добавить("КолКод");
	  //ТабЗначений.Колонки.Добавить("КолНоменклатура");
	  //ТабЗначений.Колонки.Добавить("КолКоличество");
	  //
	  
	  
	  Для Каждого ЭлМассив из ДвумМассив Цикл
		  
		  
			 // найду все контакты за период  по должнику
		    
		  
			   
			   резКонт= НайтиСколькоКонтактов(ЭлМассив[0],Объект.ДатаНачала,Объект.ДатаКонец );
			   
			   стр= Объект.ТЧ.Добавить();
			   
			   
			   
			   //
			    стр.НомерДоговора=ЭлМассив[1];
			    стр.Должник=ЭлМассив[0];
			    стр.ЗвонокВсего=резКонт["ВсегоКонтактов"];
			    
			   
			    стр.ЗвонокУспешные=резКонт["ХорошихКонтактов"];
			   // 
			   // 
			    стр.Результат=резКонт["ПоследнийСтатус"];
			   // 
		  
				
				
			   
		  //Сообщить(Строка(ЭлМассив[0])+"-"+Строка(ЭлМассив[1]));
      КонецЦикла;
	   
	 
	   
	       Объект.ТЧ.Сортировать("Должник");
	 
	 
	 Сообщить("Ок");
	
КонецПроцедуры


&НаСервере
Функция НайтиСколькоКонтактов(долж,датнач,датак)

	
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Контакт.Статус КАК Статус,
	//	|	Контакт.Телефоны.(
	//	|		КОЛИЧЕСТВО(РезультатКонтакта) КАК РезультатКонтакта
	//	|	) КАК Телефоны
	//	|ИЗ
	//	|	Документ.Контакт КАК Контакт
	//	|ГДЕ
	//	|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
	//	|	И Контакт.Должник = &Должник
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Контакт.Дата";
	//
	

	
	 резКонт = Новый Структура;
	 
	  //спрСтатусП1=Справочники.Статусы.НайтиПоНаименованию("Обещание оплатить",Истина);
	  
	  
	 
	 
	 спрСтатусП1=Справочники.Статусы.НайтиПоКоду("000000003",Истина);
	 
	 спрСтатусП2=Справочники.Статусы.НайтиПоКоду("000000009",Истина);
	 
	 спрСтатусП21=Справочники.Статусы.НайтиПоКоду("000000001",Истина);
	 
	 спрСтатусП3=Справочники.Статусы.НайтиПоНаименованию("Прогноз");
	 
	 спрСтатусП31=Справочники.Статусы.НайтиПоКоду("000000002",Истина);
	 
	 //спрСтатусП41=Справочники.Статусы.НайтиПоНаименованию("Оставлена информация",Истина);
	 
	 спрСтатусП4=Справочники.Статусы.НайтиПоКоду("000000005",Истина);
	 
	 хорКонтакт=0;
	 
	 всегоКонт=0;
	 
	 статусПосл=Неопределено;
	 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контакт.Статус КАК Статус
		|ИЗ
		|	Документ.Контакт КАК Контакт
		|ГДЕ
		|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
		|	И Контакт.Должник = &Должник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контакт.Дата";
	
	
		
	Запрос.УстановитьПараметр("ДатаКонец", датак);
	Запрос.УстановитьПараметр("ДатаНачала", датнач);
	Запрос.УстановитьПараметр("Должник", долж);
	

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		  всегоКонт=всегоКонт+1;
		  
		 статусВ=ВыборкаДетальныеЗаписи.Статус;
		 
		 		 
		Если  (статусВ.Наименование=спрСтатусП1.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		КонецЕсли;

		 		 
		Если  (статусВ.Наименование=спрСтатусП2.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 
	 	Если  (статусВ.Наименование=спрСтатусП21.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
	
		 
		 Если  (статусВ.Наименование=спрСтатусП3.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 Если  (статусВ.Наименование=спрСтатусП31.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		 
		 

		  Если  (статусВ.Наименование=спрСтатусП4.Наименование)   Тогда
		
			 хорКонтакт=хорКонтакт+1;
		
		 КонецЕсли;
		
		
		 
				
		статусПосл=ВыборкаДетальныеЗаписи.Статус;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

      
        
	  резКонт.Вставить("ВсегоКонтактов",всегоКонт);
	  
	  резКонт.Вставить("ХорошихКонтактов", хорКонтакт);
	  
	  резКонт.Вставить("ПоследнийСтатус", статусПосл);
	  

	
	   Возврат резКонт;

КонецФункции // ()





&НаСервере
Функция СформироватьНаСервере(банк)

	     // Найти долж где банк - 
	
	
	     ДвумМассив = Новый Массив;
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Владелец КАК Владелец,
			|	Договоры.НомерДоговора КАК НомерДоговора
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.Банк = &Банк";
		
		Запрос.УстановитьПараметр("Банк", банк);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			
			ОднмМассив = Новый Массив(2);
			
			ОднмМассив[0] = ВыборкаДетальныеЗаписи.Владелец;
            ОднмМассив[1] = ВыборкаДетальныеЗаписи.НомерДоговора;
            ДвумМассив.Добавить(ОднмМассив);
			
			
			
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
		
		
		
		
		
		Возврат ДвумМассив;
		
		

КонецФункции // ()

&НаКлиенте
Процедура Печать(Команда)
	// Вставить содержимое обработчика.
	 ТабДокумент= ПолучитьМакетНаСервере();
	
     ТабДокумент.Показать("ОТЧЕТ АГЕНТА");

	
	Сообщить("Ок");
КонецПроцедуры
 



&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;
    ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет =  ОтчетОбъект.ПолучитьМакет("Макет"); 
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаНачала=Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаКонец=Формат(Объект.ДатаКонец,"ДФ=dd.MM.yyyy");
	
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	
	
	
	Для каждого Стр  Из Объект.ТЧ  Цикл
		
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		
		
		ОбластьСтрока.Параметры.НомерДоговора=Стр.НомерДоговора;
		ОбластьСтрока.Параметры.ФИО=Стр.Должник;
		ОбластьСтрока.Параметры.ЗвонокВсего=Стр.ЗвонокВсего;
		ОбластьСтрока.Параметры.ЗвонокУспешные=Стр.ЗвонокУспешные;
		ОбластьСтрока.Параметры.Результат=Стр.Результат;
		
		 ТабДокумент.Вывести(ОбластьСтрока);
	
	 КонецЦикла;
	 
	 
	
	
    ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
	
	
	ТабДокумент.Вывести(ОбластьПодвал);


	

    Возврат  ТабДокумент;
    
КонецФункции
